back-end/app/Controllers/OperacoesController.php

    public function getAll() {
        $model = new OperacoesModel();
        $data = $model->findAll();
---
SELECT *
FROM `operacoes`

    public function add() {
        $model = new OperacoesModel();
        $operacoes = $this->request->getJSON();
        $model->insert(
            [
                'nome' => $operacoes->nome,
                'operacao' => $operacoes->operacao,
                'resultado' => $operacoes->resultado
              ]
        );
---
INSERT INTO `operacoes` (`nome`, `operacao`, `resultado`, `data`, `updated_at`) VALUES ('Patrik', '11*9', 99, '2023-05-27 11:32:59', '2023-05-27 11:32:59')